---
kind: property
id: P:Autodesk.Revit.UI.Events.FormulaEditingEventArgs.ParameterId
source: html/b6264bdc-0dcf-2a62-d908-6ce4bf98330d.htm
---
# Autodesk.Revit.UI.Events.FormulaEditingEventArgs.ParameterId Property

Returns the Id of the modified parameter

## Syntax (C#)
```csharp
public ElementId ParameterId { get; }
```